spec/fixtures/charges_created.yml

---
http_interactions:
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"d8698334-03e9-4de9-86fd-f358aeb0b94b","first_name":"myFirstName","email":"d8698334-03e9-4de9-86fd-f358aeb0b94b@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 12 Jun 2016 12:44:31 GMT
      Etag:
      - W/"bda903da959f9372b410f9f2155a3a02"
      Location:
      - "/users/d8698334-03e9-4de9-86fd-f358aeb0b94b"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 71a3d815-53fb-4782-a2c7-dffcda93527d
      X-Runtime:
      - '0.941515'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '932'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-06-12T12:44:30.738Z","updated_at":"2016-06-12T12:44:30.738Z","full_name":"myFirstName","email":"d8698334-03e9-4de9-86fd-f358aeb0b94b@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"d8698334-03e9-4de9-86fd-f358aeb0b94b","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"ba74956b-54f4-4e1f-860d-8fbdf63383b6"},"links":{"self":"/users","items":"/users/d8698334-03e9-4de9-86fd-f358aeb0b94b/items","card_accounts":"/users/d8698334-03e9-4de9-86fd-f358aeb0b94b/card_accounts","paypal_accounts":"/users/d8698334-03e9-4de9-86fd-f358aeb0b94b/paypal_accounts","bank_accounts":"/users/d8698334-03e9-4de9-86fd-f358aeb0b94b/bank_accounts","wallet_accounts":"/users/d8698334-03e9-4de9-86fd-f358aeb0b94b/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 12 Jun 2016 12:44:31 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/card_accounts
    body:
      encoding: UTF-8
      string: '{"user_id":"d8698334-03e9-4de9-86fd-f358aeb0b94b","full_name":"User
        Name","number":"4111111111111111","expiry_month":6,"expiry_year":2017,"cvv":"123"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 12 Jun 2016 12:44:34 GMT
      Etag:
      - W/"609f27b71812d711842a97ee7302490b"
      Location:
      - "/card_accounts/b0277a21-3007-4606-b519-bf59cc43e356"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 33d9ec7b-8da0-482e-ba19-9ea01ea5856e
      X-Runtime:
      - '1.765421'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"card_accounts":{"active":true,"created_at":"2016-06-12T12:44:34.663Z","updated_at":"2016-06-12T12:44:34.663Z","id":"b0277a21-3007-4606-b519-bf59cc43e356","currency":"AUD","links":{"self":"/card_accounts/b0277a21-3007-4606-b519-bf59cc43e356","users":"/card_accounts/b0277a21-3007-4606-b519-bf59cc43e356/users"}}}'
    http_version: 
  recorded_at: Sun, 12 Jun 2016 12:44:35 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/charges
    body:
      encoding: UTF-8
      string: '{"account_id":"b0277a21-3007-4606-b519-bf59cc43e356","user_id":"d8698334-03e9-4de9-86fd-f358aeb0b94b","name":"Charge
        for Delivery","email":"anonymous+buyer+1@promisepay.com","amount":4500,"zip":"3000","curency":"AUD","country":"AUS","retain_account":true,"device_id":"0900JapG4txqVP4Nf94lis1ztmY64bRzRufIskMqKRxYZWFibp4j/+DwRPTztbpmYmDn9n3uDZG7y79QuA+jSTdt2mU8BZeT94rSue+B4M2wkqImINsJ9VlMYGTX23I2zuDzEYngAz99aSN3ySC3tvRP4YCTJbtlNWlumGODXWbkrLSLP/wT3etan16/FINOuYS5LH/sQ/sXqk0yDUQkBm21+3hdrSzenwv2iK7pMCw9zdRN+3jlt//OauTQHjy7H5XhLHCHAGY3J0jpLqVrSVzsI1LB6M5fl2EoMEAoEitEttFUo1DRkUtPGPRhfRZSJgi/2XEcZH+tN3R4VShbY+EVBD6upMsx8e+4a0Yy5JnHYpPz7R1zkAHAFKeaPzHTB6yLaYIZf7bM7FD9I4jOJ33S01NZtVmpaU+ltXRybJL065B3xBfNPgHEB08CRvIVZ/7OW/kWLcmvNeDVSi9QfH7TEmxGFWkS2PTjdOIYgHC/3QaUBo+BORdkpO8mR20/oWqfaTXAiPJhDc7Kf2hhwqstJ+rhabIcxurYS9YOYuyRGpb/IognXxhY6dXh35GdB6Cc0rdKBra3m4ajKT2dl0HzU5BUzQgct4fSViSftA9S4WN+/u06EOo/UEYn9EFMRfvxVguGdCj5lheliCBIlujE9p5bObFITgxo+snP9+SWhwwQjHzFmjZC2x3+Dd6SKNck3/+IBhtGeSxQ+x3bbPGSKlPeImNr/UVPV6i8/tb5alAK/XRNo3H5dCCofHI9aHmKGVsh1GZGb/t+MWh63oYq0hpEwt3pHbVYAH9NfWd7xUnvIFC6f0yZnUxJtZ1tiSkVcDDQDXXUEycmHIUb3cIYInqn0vWZ4E9DERA11M8IkCuPI7c/6cZ+WudVvu4eBdAZLc3MKdVnbnSmjIkq5qftS7QndrGGVnAk80aKvKixGUf6oxNEfoZFV+S24ttMGG6sXUx2ddU5OPCCOX680qzq/uUq87u17lXRMFdx4wimxQE05lyt1veYpHNuv7sghWOEeioIZRnmC0W+ochQziz7ftZJCaKwymxS1wfmZzpno82u3Z2HQd3V4wfJ/zck+QECqJOz7YCWoR/mx2vNwg2Qek4/nm8ErLEbx5REX5I2a/52aev9sHy3VFGNJrl9WRwxtuSe+IVmUVHMK436hmn9pJQL8E0wyEGvoAODQNpCPDLzpW3aa+9Wp5YstdZ3m/rUv5dztqLbo6mZ2MNz4rLVKY4TfJCS0UoHWAVvYG/EH/md2OpxAZVeiYsco/z52WqDHt7uDpkIrv9JRPmShTpHVC2Al7FLtDsZ","ip_address":"172.16.81.100"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 12 Jun 2016 12:44:44 GMT
      Etag:
      - W/"127a67b2ee57b2a4c0a91076b3455031"
      Location:
      - "/charges/3ddc2bb8-0067-458d-a827-3ae761570371"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - ee5a2e75-bfa5-45fc-8675-9afe14459805
      X-Runtime:
      - '7.940000'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"charges":{"id":"3ddc2bb8-0067-458d-a827-3ae761570371","name":"Charge
        for Delivery","created_at":"2016-06-12T12:44:37.451Z","updated_at":"2016-06-12T12:44:44.437Z","state":"completed","buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"status":22500,"amount":4500,"custom_data":null,"account_type":"Credit
        Card Account","account_id":"b0277a21-3007-4606-b519-bf59cc43e356","promisepay_fee":187,"currency":"AUD","payment_method":"charge","buyer_name":"myFirstName","buyer_email":"d8698334-03e9-4de9-86fd-f358aeb0b94b@mail.com","buyer_zip":"3000","buyer_country":"AUS","related":{"buyers":"d8698334-03e9-4de9-86fd-f358aeb0b94b","sellers":"3faa11a7c4b663881f04c35b75b46e2c"},"links":{"self":"/charges","buyers":"/charges/3ddc2bb8-0067-458d-a827-3ae761570371/buyers","sellers":"/charges/3ddc2bb8-0067-458d-a827-3ae761570371/sellers","status":"/charges/3ddc2bb8-0067-458d-a827-3ae761570371/status","fees":"/charges/3ddc2bb8-0067-458d-a827-3ae761570371/fees","transactions":"/charges/3ddc2bb8-0067-458d-a827-3ae761570371/transactions","batch_transactions":"/charges/3ddc2bb8-0067-458d-a827-3ae761570371/batch_transactions"}}}'
    http_version: 
  recorded_at: Sun, 12 Jun 2016 12:44:46 GMT
recorded_with: VCR 2.9.3
