spec/fixtures/charges_single.yml

---
http_interactions:
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/users
    body:
      encoding: UTF-8
      string: '{"id":"475d03b7-4149-469f-86bd-6c2c53914f5d","first_name":"myFirstName","email":"475d03b7-4149-469f-86bd-6c2c53914f5d@mail.com","country":"AUS"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 12 Jun 2016 12:39:24 GMT
      Etag:
      - W/"84886b216f4a310eae0fd70795ce7269"
      Location:
      - "/users/475d03b7-4149-469f-86bd-6c2c53914f5d"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 082ac940-8e43-42a5-8cd4-d9f6a07f1cdd
      X-Runtime:
      - '0.885231'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"users":{"created_at":"2016-06-12T12:39:24.247Z","updated_at":"2016-06-12T12:39:24.247Z","full_name":"myFirstName","email":"475d03b7-4149-469f-86bd-6c2c53914f5d@mail.com","mobile":null,"phone":null,"logo_url":null,"color_1":null,"color_2":null,"first_name":"myFirstName","last_name":null,"id":"475d03b7-4149-469f-86bd-6c2c53914f5d","location":"AUS","verification_state":"pending","held_state":false,"dob":null,"government_number":null,"drivers_license":null,"flags":{},"related":{"addresses":"06108e1c-bb78-4739-8171-0314ad89e404"},"links":{"self":"/users","items":"/users/475d03b7-4149-469f-86bd-6c2c53914f5d/items","card_accounts":"/users/475d03b7-4149-469f-86bd-6c2c53914f5d/card_accounts","paypal_accounts":"/users/475d03b7-4149-469f-86bd-6c2c53914f5d/paypal_accounts","bank_accounts":"/users/475d03b7-4149-469f-86bd-6c2c53914f5d/bank_accounts","wallet_accounts":"/users/475d03b7-4149-469f-86bd-6c2c53914f5d/wallet_accounts"}}}'
    http_version: 
  recorded_at: Sun, 12 Jun 2016 12:39:24 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/card_accounts
    body:
      encoding: UTF-8
      string: '{"user_id":"475d03b7-4149-469f-86bd-6c2c53914f5d","full_name":"User
        Name","number":"4111111111111111","expiry_month":6,"expiry_year":2017,"cvv":"123"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 12 Jun 2016 12:39:27 GMT
      Etag:
      - W/"dd8e4d2615dc30656b4c5032d924a3b5"
      Location:
      - "/card_accounts/93be3796-5988-4624-afab-96238ad8f0c8"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 201 Created
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 910bd8ba-ede8-4fd6-9ed5-578b4a895050
      X-Runtime:
      - '1.437082'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '313'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"card_accounts":{"active":true,"created_at":"2016-06-12T12:39:27.036Z","updated_at":"2016-06-12T12:39:27.036Z","id":"93be3796-5988-4624-afab-96238ad8f0c8","currency":"AUD","links":{"self":"/card_accounts/93be3796-5988-4624-afab-96238ad8f0c8","users":"/card_accounts/93be3796-5988-4624-afab-96238ad8f0c8/users"}}}'
    http_version: 
  recorded_at: Sun, 12 Jun 2016 12:39:27 GMT
- request:
    method: post
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/charges
    body:
      encoding: UTF-8
      string: '{"account_id":"93be3796-5988-4624-afab-96238ad8f0c8","user_id":null,"name":"Charge
        for Delivery","email":"anonymous+buyer+1@promisepay.com","amount":4500,"zip":"3000","curency":"AUD","country":"AUS","retain_account":true,"device_id":"0900JapG4txqVP4Nf94lis1ztmY64bRzRufIskMqKRxYZWFibp4j/+DwRPTztbpmYmDn9n3uDZG7y79QuA+jSTdt2mU8BZeT94rSue+B4M2wkqImINsJ9VlMYGTX23I2zuDzEYngAz99aSN3ySC3tvRP4YCTJbtlNWlumGODXWbkrLSLP/wT3etan16/FINOuYS5LH/sQ/sXqk0yDUQkBm21+3hdrSzenwv2iK7pMCw9zdRN+3jlt//OauTQHjy7H5XhLHCHAGY3J0jpLqVrSVzsI1LB6M5fl2EoMEAoEitEttFUo1DRkUtPGPRhfRZSJgi/2XEcZH+tN3R4VShbY+EVBD6upMsx8e+4a0Yy5JnHYpPz7R1zkAHAFKeaPzHTB6yLaYIZf7bM7FD9I4jOJ33S01NZtVmpaU+ltXRybJL065B3xBfNPgHEB08CRvIVZ/7OW/kWLcmvNeDVSi9QfH7TEmxGFWkS2PTjdOIYgHC/3QaUBo+BORdkpO8mR20/oWqfaTXAiPJhDc7Kf2hhwqstJ+rhabIcxurYS9YOYuyRGpb/IognXxhY6dXh35GdB6Cc0rdKBra3m4ajKT2dl0HzU5BUzQgct4fSViSftA9S4WN+/u06EOo/UEYn9EFMRfvxVguGdCj5lheliCBIlujE9p5bObFITgxo+snP9+SWhwwQjHzFmjZC2x3+Dd6SKNck3/+IBhtGeSxQ+x3bbPGSKlPeImNr/UVPV6i8/tb5alAK/XRNo3H5dCCofHI9aHmKGVsh1GZGb/t+MWh63oYq0hpEwt3pHbVYAH9NfWd7xUnvIFC6f0yZnUxJtZ1tiSkVcDDQDXXUEycmHIUb3cIYInqn0vWZ4E9DERA11M8IkCuPI7c/6cZ+WudVvu4eBdAZLc3MKdVnbnSmjIkq5qftS7QndrGGVnAk80aKvKixGUf6oxNEfoZFV+S24ttMGG6sXUx2ddU5OPCCOX680qzq/uUq87u17lXRMFdx4wimxQE05lyt1veYpHNuv7sghWOEeioIZRnmC0W+ochQziz7ftZJCaKwymxS1wfmZzpno82u3Z2HQd3V4wfJ/zck+QECqJOz7YCWoR/mx2vNwg2Qek4/nm8ErLEbx5REX5I2a/52aev9sHy3VFGNJrl9WRwxtuSe+IVmUVHMK436hmn9pJQL8E0wyEGvoAODQNpCPDLzpW3aa+9Wp5YstdZ3m/rUv5dztqLbo6mZ2MNz4rLVKY4TfJCS0UoHWAVvYG/EH/md2OpxAZVeiYsco/z52WqDHt7uDpkIrv9JRPmShTpHVC2Al7FLtDsZ","ip_address":"172.16.81.100"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 12 Jun 2016 12:39:37 GMT
      Etag:
      - W/"8883b3474f69571d52e95b44677a4d96"
      Location:
      - "/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Set-Cookie:
      - request_method=POST; path=/
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 902b770c-0889-4278-815b-584a2cfb6a79
      X-Runtime:
      - '9.260406'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"charges":{"id":"5fb6f16a-6ec1-4725-b811-4f83327c8fbe","name":"Charge
        for Delivery","created_at":"2016-06-12T12:39:28.725Z","updated_at":"2016-06-12T12:39:36.813Z","state":"completed","buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"status":22500,"amount":4500,"custom_data":null,"account_type":"Credit
        Card Account","account_id":"93be3796-5988-4624-afab-96238ad8f0c8","promisepay_fee":187,"currency":"AUD","payment_method":"charge","buyer_name":"myFirstName","buyer_email":"475d03b7-4149-469f-86bd-6c2c53914f5d@mail.com","buyer_zip":"3000","buyer_country":"AUS","related":{"buyers":"475d03b7-4149-469f-86bd-6c2c53914f5d","sellers":"3faa11a7c4b663881f04c35b75b46e2c"},"links":{"self":"/charges","buyers":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe/buyers","sellers":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe/sellers","status":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe/status","fees":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe/fees","transactions":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe/transactions","batch_transactions":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe/batch_transactions"}}}'
    http_version: 
  recorded_at: Sun, 12 Jun 2016 12:39:37 GMT
- request:
    method: get
    uri: https://<USERNAME>:<TOKEN>@test.api.promisepay.com/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Origin, Content-Type, Accept, Authorization, Token
      Access-Control-Allow-Methods:
      - POST, GET, PUT, DELETE, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '1728000'
      Access-Control-Request-Method:
      - "*"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Sun, 12 Jun 2016 12:39:38 GMT
      Etag:
      - W/"f62d123ddee7f2db072a07332f6333f5"
      Location:
      - "/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe"
      Server:
      - nginx/1.8.0 + Phusion Passenger 4.0.59
      Status:
      - 200 OK
      X-Content-Type-Options:
      - nosniff
      X-Frame-Options:
      - SAMEORIGIN
      X-Powered-By:
      - Phusion Passenger 4.0.59
      X-Request-Id:
      - 21fc9ba0-89a4-4160-9ec4-ebc3f827a4ba
      X-Runtime:
      - '0.543789'
      X-Xss-Protection:
      - 1; mode=block
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"charges":{"id":"5fb6f16a-6ec1-4725-b811-4f83327c8fbe","name":"Charge
        for Delivery","created_at":"2016-06-12T12:39:28.725Z","updated_at":"2016-06-12T12:39:36.813Z","state":"completed","buyer_fees":0,"seller_fees":0,"credit_card_fee":0,"status":22500,"amount":4500,"custom_data":null,"account_type":"Credit
        Card Account","account_id":"93be3796-5988-4624-afab-96238ad8f0c8","promisepay_fee":187,"currency":"AUD","payment_method":"charge","buyer_name":"myFirstName","buyer_email":"475d03b7-4149-469f-86bd-6c2c53914f5d@mail.com","buyer_zip":"3000","buyer_country":"AUS","related":{"buyers":"475d03b7-4149-469f-86bd-6c2c53914f5d","sellers":"3faa11a7c4b663881f04c35b75b46e2c"},"links":{"self":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe","buyers":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe/buyers","sellers":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe/sellers","status":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe/status","fees":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe/fees","transactions":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe/transactions","batch_transactions":"/charges/5fb6f16a-6ec1-4725-b811-4f83327c8fbe/batch_transactions"}}}'
    http_version: 
  recorded_at: Sun, 12 Jun 2016 12:39:39 GMT
recorded_with: VCR 2.9.3
